const knowledge = [
  [
    "Электрическое поле",
    "является",
    "физическим полем, окружающим электрически заряженные частицы, вызывающим воздействие на другие заряженные частицы внутри этого поля.",
  ],
  [
    "Сила тока",
    "определяется",
    "количеством электричества, протекающего через поперечное сечение проводника за единицу времени.",
  ],
  [
    "Электродинамика",
    "изучает",
    "законы движения электрических зарядов и электромагнитные поля в пространстве и времени.",
  ],
  [
    "Тепловое воздействие",
    "влияет",
    "на изменение сопротивления проводника из-за изменения температуры.",
  ],
  [
    "Проводимость",
    "зависит",
    "от количества свободных носителей заряда в веществе и подвижности этих носителей.",
  ],
  [
    "Кристаллическая структура",
    "влияет",
    "на сопротивление проводника при его нагревании.",
  ],
  [
    "Удельное сопротивление",
    "характеризует",
    "сопротивление единичного образца материала при единичной длине и площади поперечного сечения.",
  ],
  [
    "Зависимость сопротивления от температуры",
    "определяется",
    "коэффициентом температурного сопротивления материала.",
  ],
  [
    "Электрический ток",
    "является",
    "потоком заряженных частиц, движущихся вдоль проводника под воздействием электрического поля.",
  ],
  [
    "Энергетические потери",
    "возникают",
    "в проводнике из-за тепловых эффектов при прохождении электрического тока.",
  ],
  [
    "Экспериментальная установка",
    "используется",
    "для измерения удельного сопротивления проводника при его нагревании.",
  ],
  [
    "Электрическое сопротивление",
    "определяется",
    "отношением напряжения к силе тока в электрической цепи.",
  ],
  [
    "Проводимость материала",
    "определяется",
    "способностью проводить электрический ток под воздействием электрического поля.",
  ],
  [
    "Теплопроводность",
    "описывает",
    "способность вещества передавать тепловую энергию.",
  ],
  [
    "Омметр",
    "применяется",
    "для измерения электрического сопротивления проводника.",
  ],
  [
    "Тепловое равновесие",
    "достигается",
    "при установлении равномерной температуры в экспериментальной установке.",
  ],
  [
    "Разогрев проводника",
    "приводит",
    "к изменению его сопротивления из-за воздействия тепловой энергии.",
  ],
  [
    "Тепловое расширение",
    "влияет",
    "на размеры и форму проводника при изменении его температуры.",
  ],
  [
    "Электрическое сопротивление",
    "определяется",
    "материалом и геометрией проводника.",
  ],
  [
    "Температурный коэффициент сопротивления",
    "описывает",
    "изменение сопротивления проводника при изменении температуры.",
  ],
  [
    "Электрический заряд",
    "представляет",
    "основную единицу измерения электрического заряда частицы.",
  ],
  [
    "Свободные носители заряда",
    "обеспечивают",
    "передачу электрического тока в проводнике.",
  ],
  [
    "Энергия",
    "расходуется",
    "на преодоление сопротивления проводника при прохождении электрического тока.",
  ],
  [
    "Токопроводящие материалы",
    "обладают",
    "высокой проводимостью и низким сопротивлением.",
  ],
  [
    "Скорость движения свободных носителей заряда",
    "определяет",
    "интенсивность электрического тока.",
  ],
  [
    "Усредненное тепловое движение",
    "приводит",
    "к статистическому распределению энергии в веществе.",
  ],
  [
    "Длина проводника",
    "влияет",
    "на его сопротивление при прохождении электрического тока.",
  ],
  [
    "Площадь поперечного сечения проводника",
    "определяет",
    "сопротивление при прохождении электрического тока.",
  ],
  [
    "Электрическая цепь",
    "содержит",
    "элементы, включая проводники, источники тока и нагрузки.",
  ],
  [
    "Тепловое равновесие",
    "достигается",
    "при одинаковой температуре внутри проводника.",
  ],
  [
    "Источник тока",
    "производит",
    "электрическую энергию для потребления в электрической цепи.",
  ],
  [
    "Удельное сопротивление материала",
    "зависит",
    "от химических свойств вещества и температуры.",
  ],
  [
    "Константа материала",
    "определяет",
    "постоянство сопротивления при изменении температуры.",
  ],
  [
    "Температурная зависимость сопротивления",
    "характеризует",
    "изменение сопротивления проводника с изменением температуры.",
  ],
  [
    "Полупроводниковый материал",
    "используется",
    "для создания электронных компонентов с контролируемой проводимостью.",
  ],
  [
    "Электролиты",
    "характеризуются",
    "высокой проводимостью при перемещении ионов.",
  ],
  [
    "Электрические свойства материала",
    "определяются",
    "структурой его атомов и молекул.",
  ],
  [
    "Мощность",
    "вычисляется",
    "как произведение силы тока на напряжение в электрической цепи.",
  ],
  [
    "Энергопотери",
    "связаны",
    "с преобразованием энергии в тепло при прохождении тока через проводник.",
  ],
  [
    "Схема установки",
    "помогает",
    "в проведении измерений удельного сопротивления проводника.",
  ],
  [
    "Электрический ток",
    "протекает",
    "в проводнике из-за движения свободных носителей заряда.",
  ],
  [
    "Сопротивление материала",
    "влияет",
    "на эффективность передачи электрического тока.",
  ],
  [
    "Энергия",
    "потребляется",
    "при преодолении сопротивления проводника при прохождении тока.",
  ],
  [
    "Электроника",
    "использует",
    "свойства материалов для создания электрических устройств.",
  ],
  [
    "Магнитное поле",
    "воздействует",
    "на движение заряженных частиц в проводнике.",
  ],
  [
    "Кондуктивность материала",
    "определяется",
    "его способностью проводить электрический ток.",
  ],
  ["Компоненты установки", "включают", "горелку, стойку, омметр и термометр."],
  [
    "Тепловое сопротивление",
    "определяет",
    "трудность передачи тепла через материал.",
  ],
  [
    "Плотность электрического тока",
    "зависит",
    "от площади поперечного сечения проводника.",
  ],
  [
    "Электромагнитное воздействие",
    "приводит",
    "к изменению свойств проводника.",
  ],
  [
    "Электрический диполь",
    "обладает",
    "полярностью и способен создавать электрическое поле в проводнике.",
  ],
  [
    "Медь",
    "является", 
    "хорошим проводником из-за своей высокой проводимости."
  ],
  [
    "Электрическое напряжение",
    "приводит",
    "к движению электрических зарядов в проводнике.",
  ],
  [
    "Энергетические потери",
    "возникают",
    "при преобразовании энергии в тепло в проводнике.",
  ],
  [
    "Электростатические силы",
    "воздействуют",
    "на заряды в проводнике, создавая движение.",
  ],
  [
    "Устройства измерения",
    "помогают",
    "определить параметры электрических свойств материалов.",
  ],
  [
    "Термодинамические процессы",
    "влияют",
    "на изменение сопротивления проводника.",
  ],
  [
    "Теплоотдача", 
    "происходит", 
    "через проводник при нагревании."
],
  [
    "Изоляция",
    "предотвращает",
    "нежелательный контакт с проводниками для безопасности.",
  ],
  [
    "Электрическая емкость",
    "определяет",
    "способность проводника накапливать заряд.",
  ],
  [
    "Температурный градиент",
    "вызывает",
    "изменения в сопротивлении проводника.",
  ],
  [
    "Электрические контакты",
    "позволяют",
    "подключить проводники к другим элементам цепи.",
  ],
  [
    "Диэлектрические материалы",
    "характеризуются",
    "низкой проводимостью для электрического тока.",
  ],
  ["Источник нагрева", "приводит", "к повышению температуры проводника."],
  [
    "Физические свойства материала",
    "влияют",
    "на его способность проводить электрический ток.",
  ],
  [
    "Георг Ом",
    "сформулировал",
    "знаменитый закон, описывающий связь между напряжением, током и сопротивлением в электрической цепи.",
  ],
  [
    "Закон Ома",
    "является",
    "одним из основных принципов в изучении электричества и электроники.",
  ],
  [
    "Электрический заряд",
    "бывает",
    "положительным или отрицательным в зависимости от количества эксцентрических электронов.",
  ],
  [
    "Модель атома",
    "описывает",
    "положительно заряженное ядро, вокруг которого обращаются отрицательно заряженные электроны.",
  ],
  [
    "Элементарный электрический заряд",
    "равен",
    "приблизительно 1.602 x 10^-19 кулонов.",
  ],
  [
    "Закон Кулона",
    "описывает",
    "взаимодействие между заряженными частицами с учетом величины и расстояния между ними.",
  ],
  [
    "Сила тока",
    "определяется",
    "количеством электрических зарядов, протекающих через единицу времени.",
  ],
  [
    "Электрический потенциал",
    "связан",
    "с работой по перемещению заряда в электрическом поле.",
  ],
  [
    "Электростатика",
    "изучает",
    "статические заряды и их взаимодействие в отсутствии движения.",
  ],
  [
    "Принцип сохранения заряда",
    "утверждает",
    "неизменность общего количества электрического заряда в изолированной системе.",
  ],
  [
    "Изолированные системы",
    "сохраняют",
    "суммарный электрический заряд неизменным с течением времени.",
  ],
  [
    "Спиртовая горелка",
    "представляет",
    "устройство для создания открытого огня, использующее спирт в качестве топлива.",
  ],
  [
    "Омметр",
    "является",
    "прибором для измерения электрического сопротивления в электрических цепях.",
  ],
  [
    "Термометр",
    "предназначен",
    "для измерения температуры вещества или окружающей среды.",
  ],
  [
    "Температура",
    "определяется",
    "количеством тепловой энергии в системе или среде.",
  ],
  [
    "Нагревание",
    "является",
    "процессом передачи тепловой энергии объекту, повышающим его температуру.",
  ],
  [
    "Тепловой поток",
    "передает",
    "тепловую энергию от более горячего объекта к менее горячему.",
  ],
  [
    "Экспансия",
    "происходит",
    "при увеличении объема вещества в результате его нагревания.",
  ],
  [
    "Фазовые переходы",
    "включают",
    "изменения состояния вещества при изменении температуры.",
  ],
  [
    "Термодинамические процессы",
    "связаны",
    "с изменением температуры и энергии в системе.",
  ],
  [
    "Теплопроводность",
    "определяет",
    "способность вещества передавать тепловую энергию.",
  ],
  [
    "Термическое равновесие",
    "достигается",
    "при равномерном распределении тепла в системе.",
  ],
  [
    "Константа материала",
    "определяется",
    "его химическим составом и структурой."
  ],
  [
    "Проводимость материала",
    "зависит",
    "от наличия свободных носителей заряда и их подвижности в структуре материала."
  ],
  [
    "Тепловое равновесие",
    "описывается",
    "как состояние, при котором тепловой поток через него остается постоянным."
  ],
  [
    "Тепловое расширение",
    "приводит",
    "к увеличению размеров материала при нагреве, что может приводить к изменению его свойств, включая проводимость."
  ],
  [
    "Основой закона сохранения заряда",
    "является",
    "то, что заряд не может быть создан или уничтожен, только передан от одной частицы к другой."
  ],
  [
    "Электростатические силы",
    "характеризуются",
    "отсутствием свободных зарядов в состоянии покоя и равновесия."
  ],
  [
    "Высокая теплопроводность вещества",
    "способствует",
    "быстрому отводу тепла, что может помочь поддерживать устойчивость электрического тока в материале."
  ],
  [
    "Сопротивление проводника",
    "зависит",
    "от его материала, длины, площади поперечного сечения и температуры."
  ],
  [
    "Тепловое сопротивление материала",
    "определяется",
    "его свойствами, геометрией и теплопроводностью и определяет уровень сопротивления тепловому потоку через него."
  ],
  [
    "В системе термическое равновесие",
    "достигается",
    ", когда тепловой поток внутри нее становится постоянным, и нет нетто перемещения тепла между ее частями."
  ],
  [
    "Элементарный электрический заряд",
    "связан",
    "с электрическими взаимодействиями между частицами в материи и обычно представляет собой минимальный заряд, который может существовать в природе."
  ],
  [
    "Для измерения электрического сопротивления проводника",
    "используют",
    "методы вольтметра-амперметра."
  ],
  [
    "Температурный градиент",
    "увеличивает",
    "сопротивление из-за изменения средней свободной длины пути носителей заряда."
  ],
  [
    "Тепловое равновесие материалов",
    "определяется",
    "их способностью к теплопроводности, теплоемкостью и возможностью равномерно распределять получаемое или отдаваемое тепло."
  ],
  [
    "Термодинамические процессы",
    "определяются",
    "преобразованием электрической энергии в тепловую энергию из-за сопротивления проводника."
  ],
  [
    "Факторы, влияющие на процесс нагревания проводника,",
    "включают",
    "интенсивность тока, его сопротивление, материал проводника и окружающую среду."
  ],
  [
    "Основные особенности закона Кулона в электричестве",
    "связаны",
    "с взаимодействием между заряженными частицами, пропорциональными произведению их зарядов и обратно пропорциональными квадрату расстояния между ними."
  ],
  [
    "Тепловой поток в проводнике",
    "определяется",
    "градиентом температуры, теплопроводностью материала и геометрией проводника."
  ],
  [
    "Сила тока",
    "измеряется",
    "амперметром как количество электрических зарядов, проходящих через сечение проводника за единицу времени."
  ],
  [
    "Электрический потенциал",
    "определяется",
    "разностью потенциалов между двумя точками в электрической цепи, вызванной разделением зарядов или работой электрического поля."
  ],
  [
    "Термодинамические процессы в электрических цепях",
    "влияют",
    "на тепловые потери из-за сопротивления проводника, изменения температуры и потерь энергии в других элементах цепи."
  ],
  [
    "Для измерения температуры проводника",
    "используются",
    "термопары, терморезисторы, инфракрасные термометры или термисторы."
  ],
  [
    "Диэлектрические материалы",
    "характеризуются",
    "тем, что они плохо проводят электрический ток, но способны подвергаться поляризации под воздействием электрического поля."
  ],
  [
    "Тепловое сопротивление",
    "описывает",
    "способность материала сопротивляться тепловому потоку и может быть измерено, например, испытаниями на теплопроводность или с помощью тепловых сенсоров."
  ],
  [
    "Изоляция",
    "играет",
    "ключевую роль в безопасности при работе с электричеством, предотвращая контакт человека с электрическими проводниками и предупреждая возможные короткие замыкания или утечки тока."
  ],
  [
    "Константа материала",
    "меняется",
    "изменением условий, таких как температура."
  ],
  [
    "Удельное сопротивление материала",
    "зависит",
    "от его физических свойств, таких как концентрация свободных носителей заряда, подвижность носителей заряда и температура."
  ],
  [
    "Температурная зависимость сопротивления",
    "увеличивается",
    "из-за увеличения внутреннего движения атомов и заряженных носителей в материале."
  ],
  [
    "Полупроводниковые материалы",
    "позволяют",
    "изменять проводимость с помощью примесей, что отличает их от других материалов."
  ],
  [
    "Электролиты",
    "проводят",
    "электрический ток при наличии ионов в растворе или расплаве."
  ],
  [
    "Структура атомов и молекул",
    "влияет",
    "на электрические свойства материала через его способность проводить электрический ток и взаимодействие зарядов."
  ],
  [
    "Электрическое сопротивление материала",
    "определяется",
    "структурой материала через наличие свободных носителей заряда и их подвижность, а также геометрией материала."
  ],
  [
    "Изменение сопротивления проводника",
    "описывается",
    "законом, согласно которому сопротивление увеличивается при изменении температуры."
  ],
  [
    "Свободные носители заряда",
    "играют",
    "ключевую роль в передаче электрического тока."
  ],
  [
      "Энергия при прохождении электрического тока через проводник",
      "тратится",
      "на преодоление сопротивления материала, вызывая выделение тепла и изменение температуры проводника."
  ],
  [
      "Токопроводящие материалы",
      "выдаются",
      "способностью проводить электрический ток с низкими потерями энергии и высокой эффективностью в электротехнике."
  ],
  [
      "Скорость движения свободных носителей заряда",
      "пропорциональна",
      "интенсивности тока."
  ],
  [
      "Усредненное тепловое движение",
      "представляет",
      "статистический характер движения атомов и молекул, определяющий внутреннюю энергию вещества."
  ],
  [
      "Параметры, влияющие на сопротивление проводника,",
      "включают",
      "длину, площадь поперечного сечения, температуру и материал."
  ],
  [
      "Электрическая цепь",
      "определяется",
      "как совокупность электрически связанных элементов, включая источники энергии, проводники, резисторы, конденсаторы и другие элементы."
  ],
  [
      "При достижении теплового равновесия в экспериментальной установке",
      "происходит",
      "установление одинаковой температуры между системами, прекращение нетто перетока тепла и установление равновесия тепловых потоков."
  ],
  [
      "Проводимость материала",
      "пропорциональна",
      "количеству свободных носителей заряда: чем больше свободных носителей, тем выше проводимость."
  ],
  [
      "Температурный коэффициент сопротивления",
      "зависит",
      "от материала и его структуры, а также может изменяться в зависимости от температуры и примесей в материале."
  ],
  [
      "Электрический заряд частицы",
      "определяется",
      "количеством избыточных или недостающих электронов в ее атоме, вызывая электрические взаимодействия в материи из-за взаимодействия заряженных частиц."
  ],
  [
      "Проводимость материала",
      "связана",
      "с его способностью проводить электрический ток: материалы с высокой проводимостью обладают большим количеством свободных носителей заряда и высокой подвижностью этих носителей, что позволяет электрическому току свободно перемещаться через материал."
  ],
  [
    'Проводником',
    'является',
    'вещество, среда, материал, хорошо проводящие электрический ток.',
  ],
  [
    'Диэлектриком',
    'является',
    'вещество, относительно плохо проводящее электрический ток.',
  ],
  [
    'Полупроводником',
    'является',
    'материал, по удельной проводимости занимающий промежуточное место между проводниками и диэлектриками, и отличающийся от проводников сильной зависимостью удельной проводимости от концентрации примесей, температуры и воздействия различных видов излучения.',
  ],
  [
    'Газовая горелка',
    'это',
    'устройство, которое создает контролируемое пламя путем смешивания горючего газа, такого как ацетилен, природный газ или пропан, с окислителем, таким как окружающий воздух или подаваемый кислород, и обеспечивающее воспламенение и горение.',
  ],
  [
    'Омметром',
    'является',
    'измерительный прибор непосредственного отсчёта для определения электрических активных сопротивлений.',
  ],
  [
    'Сопротивление',
    'измеряется',
    'в омах, для международного обозначения которых используется греческая буква омега (Ω).',
  ],
  [
    'Удельным сопротивлением',
    'называется',
    'скалярная физическая величина, численно равная сопротивлению однородного цилиндрического проводника единичной длины и единичной площади поперечного сечения.',
  ],
  ['Удельное сопротивление', 'измеряется', 'в Ом*м'],
  [
    'Температурный коэффициент электрического сопротивления',
    'измеряется',
    'в кельвинах в минус первой степени (K<sup>-1</sup>)',
  ],
  [
    'Длина',
    'есть',
    'физическая величина, числовая характеристика протяжённости линий.',
  ],
  [
    'Площадью',
    'является',
    'часть плоскости, заключённой внутри замкнутой геометрической фигуры.',
  ],
  [
    'Температура',
    'есть',
    'скалярная физическая величина, характеризующая термодинамическую систему и количественно выражающая интуитивное понятие о различной степени нагретости тел.',
  ],
  [
    'Градусом Кельвина',
    'называется',
    'единица термодинамической температуры в Международной системе единиц, одна из семи основных единиц СИ',
  ],
  [
    'Уильям Кельвин',
    'это',
    'британский физик, механик и инженер. Известен своими работами в области термодинамики, механики, электродинамики.',
  ],
  ['Градус Кельвин в Цельсиях', 'равен', '272,15 Цельсия'],
  [
    'Градусом Цельсия',
    'называется',
    'широко распространённая единица температуры, применяемая в Международной системе единиц наряду с кельвином.',
  ],
  ['Градус Цельсия в Кельвинах', 'равен', '274,15 Градусов Кельвина'],
  [
    'Термометром',
    'является',
    'измерительный прибор для измерения температуры различных тел и сред.',
  ],
  [
    'Градусником',
    'является',
    'измерительный прибор для измерения температуры различных тел и сред.',
  ],
  [
    'Термометры',
    'бывают',
    'жидкостные, механические, газовые, электрические, оптические.',
  ],
  [
    'Омметры',
    'бывают',
    'мегаомметры, гигаомметры, тераомметры, миллиомметры, микроомметры, различающиеся диапазонами измеряемых сопротивлений.',
  ],
  [
    'Графиком',
    'называтеся',
    'диаграмма, изображающая при помощи кривых количественные показатели развития, состояния чего-н.',
  ],
  [
    'Нагревом',
    'называется',
    'искусственный либо естественный процесс повышения температуры материала/тела, либо за счёт внутренней энергии, либо за счёт подведения к нему энергии извне',
  ],
  [
    'Проводом',
    'является',
    'электротехническое изделие, служащее для соединения источника электрического тока с потребителем, компонентами электрической схемы.',
  ],
  [
    'Законом Ома',
    'называется',
    'эмпирический физический закон, определяющий связь электродвижущей силы источника с силой тока, протекающего в проводнике, и сопротивлением проводника.',
  ],
  [
    'Кристаллической решёткой',
    'является',
    'вспомогательный геометрический образ, вводимый для анализа строения кристалла.',
  ],
  [
    'Неспаренный электрон',
    'представляет',
    'электрон, который занимает орбиталь атома по отдельности, а не как часть электронной пары.',
  ],
  [
    'Свободный электрон',
    'является',
    'электроном, который занимает орбиталь атома по отдельности, а не как часть электронной пары.',
  ],
  ['Автором работы', 'является', 'Гончаревич Евгений Витальевич'],
  ['Схема установки', 'выглядит', 'так <img src="./img/Schema.jpg"  />'],
  ['Карта установки', 'находится', 'так'],
  ['Термометр в работе', 'называется', 'Термометр-12.51'],
  ['Омметр в работе', 'называется', 'Омметр13-2'],
  [
    'Алюминий',
    'это',
    'химический элемент 13-й группы третьего периода периодической таблицы химических элементов Д. И. Менделеева, с атомным номером 13.',
  ],
  [
    'Свинец',
    'это',
    'элемент 14-й группы, шестого периода периодической системы химических элементов Д. И. Менделеева, с атомным номером 82 и, таким образом, содержит магическое число протонов.',
  ],
  [
    'Железо',
    'это',
    'химический элемент 8-й группы четвёртого периода периодической системы химических элементов Д. И. Менделеева с атомным номером 26.',
  ],
  [
    'Тепловым расширением',
    'является',
    'изменение линейных размеров и формы тела при изменении его температуры.',
  ],
  [
    'Термическое расширение',
    'есть',
    'изменение линейных размеров и формы тела при изменении его температуры.',
  ],
  [
    'Лаборатоный опыт',
    'называется',
    'Зависимость электрической сопротивляемости металлов от температуры',
  ],
  [
    'Атомом',
    'называется',
    'частица вещества микроскопических размеров и массы, наименьшая часть химического элемента, являющаяся носителем его свойств.',
  ],
  [
    'Протоном',
    'называется',
    'одна из трёх элементарных частиц, из которых построено обычное вещество. Протоны входят в состав атомных ядер',
  ],
  ['Заряд протона', 'равен', '1,6022⋅10<sup>-19 </sup>Кл.'],
  ['Теоретический материал', 'находится', '<a href="theory.html">здесь</a>'],
  ['Структура установки', 'находится', '<a href="struct.html">здесь</a>'],
  ['Симулятор установки', 'находится', '<a href="simulator.html">здесь</a>'],
  ['Контакты', 'находятся', '<a href="contacts.html">здесь</a>'],
  ['Главная страница', 'находится', '<a href="index.html">здесь</a>'],
  [
    'Электрическим сопротивлением проводника',
    'называется',
    'физическая величина, характеризующая свойство проводника препятствовать прохождению электрического тока.',
  ],

  [
    'Сутью лабораторного опыта',
    'является',
    'выявление зависимости сопротивления металлов от температуры.',
  ],
  ['Удельное сопротивление алюминия', 'равно', '0,028 мкОм • мм<sup>2</sup>/м'],
  ['Удельное сопротивление железа', 'равно', '0,098 мкОм • мм<sup>2</sup>/м'],
  ['Удельное сопротивление свинца', 'равно', '0,221 мкОм • мм<sup>2</sup>/м'],
  [
    'Температурный коэффициент алюминия',
    'равен',
    '<b>α = 4,2 · 10<sup>-</sup><sup>3</sup> К<sup>-</sup><sup>1</sup></b>',
  ],
  [
    'Температурный коэффициент железа',
    'равен',
    '<b>α = 6,0 · 10<sup>-</sup><sup>3</sup> К<sup>-</sup><sup>1</sup></b>',
  ],
  [
    'Температурный коэффициент свинца',
    'равен',
    '<b>α = 3,7 · 10<sup>-</sup><sup>3</sup> К<sup>-</sup><sup>1</sup></b>',
  ],
  ['Единицей измерения удельного сопротивления', 'является', 'Ом*м'],
  [
    'Резистором',
    'называется',
    'пассивный элемент электрических цепей, обладающий определённым или переменным значением электрического сопротивления, предназначенный для линейного преобразования силы тока в напряжение и напряжения в силу тока, ограничения тока, поглощения электрической энергии и др.',
  ],
  [
    'Электрическое напряжение',
    'есть',
    'разность потенциалов между двумя точками в электрическом поле. Это движущая сила для электрического заряда.',
  ],
  [
    'Напряжение между проводниками',
    'есть',
    'разность потенциалов между двумя точками в электрическом поле.',
  ],
  ['Электрический потенциал', 'измеряется', 'в Вольтах'],
  [
    'Разность потенциалов',
    'есть',
    'физическая скалярная величина, равная отношению работы, совершаемой силой поля при перемещении пробного заряда из начальной точки в конечную, к значению этого заряда',
  ],
  [
    'Алессандро Вольта',
    'это',
    'итальянский физик, химик и физиолог, один из основоположников учения об электричестве.',
  ],
  [
    'Сила тока',
    'есть',
    'скалярная физическая величина, равная отношению электрического заряда dQ, прошедшего через определённую поверхность за бесконечно малый промежуток времени dt, к длительности этого промежутка',
  ],
  [
    'Электрический ток',
    'есть',
    'направленное движение частиц или квазичастиц носителей электрического заряда.',
  ],
  [
    'Электротоком',
    'называется',
    'направленное движение частиц или квазичастиц носителей электрического заряда.',
  ],
  ['Сила электрического тока', 'измеряется', 'в Амперах'],
  [
    'Андре-Мари Ампер',
    'это',
    'французский физик, математик и естествоиспытатель.',
  ],
  [
    'Напряжённостью электрического поля',
    'называется',
    'векторная физическая величина, характеризующая электрическое поле в данной точке и равная отношению силы, действующей на неподвижный точечный заряд, помещённый в данную точку поля, к величине этого заряда q',
  ],
  [
    'Георг Симон Ом',
    'есть',
    'немецкий физик, который вывел теоретически и подтвердил на опыте закон, выражающий связь между силой тока в цепи, напряжением и сопротивлением.',
  ]
];

            //для хранения псевдоокончаний сказуемых 
            let endings =
            [
                ["ет","(ет|ут|ют)"], 
                ["ут","(ет|ут|ют)"], 
                ["ют","(ет|ут|ют)"],		     //1 спряжение

                ["ит","(ит|ат|ят)"], 
                ["ат","(ит|ат|ят)"], 
                ["ят","(ит|ат|ят)"],		     //2 спряжение

                ["ется","(ет|ут|ют)ся"], 
                ["утся","(ет|ут|ют|ующие)ся"], 
                ["ются","(ет|ут|ют)ся"], //1 спряжение, возвратные

                ["ится","(ит|ат|ят)ся"], 
                ["атся","(ит|ат|ят)ся"], 
                ["ятся","(ит|ат|ят)ся"],     //2 спряжение, возвратные

                ["ящие","ящие"],
                ["ee", "ee"],
                ["ен","ен"],
                ["ую","ая"],
                ["му","ма"],
                ["ена","ена"], 
                ["ено","ено"], 
                ["ены","ены"],		    //краткие прилагательные

                ["ан","ан"], 
                ["ая","ую"],
                ["ана","ана"], 
                ["ано","ано"], 
                ["аны","аны"],		    //краткие прилагательные

                ["но", "но"], 
                ["на", "на"],

                ["жен","жен"], 
                ["жна","жна"], 
                ["жно","жно"], 
                ["жны","жны"],

                ["такое", "- это"],
            ]

            //«черный» список подлежащих
            let blacklist = ["замена", "замены", "атрибут", "маршрут", "член", "нет"]

            //определения сказуемых в вопросе по псевдоокончаниям
            function getEndingIndex(word)
            {
                //проверка слова на совпадение по черному списку в массиве blacklist
                if(blacklist.indexOf(word) !== -1)
                    return -1;
                
                //перебор псевдоокончаний в массиве endings
                for(let i = 0; i < endings.length; i++)
                    //проверка, оканчивается ли слово word на iE-ое псевдоокончание
                    if(word.substring(word.length - endings[i][0].length) == endings[i][0])     // substring(начальный индекс, конечный)
                        //возврат номера найденного псевдоокончания для сказуемого 
                        return i;

                //если совпадений нет, то возврат -1
                return -1;
            } // пример: такое (5) - ет (2) == ет

            //Функция, которая делает первую букву в тексте маленькой:
            function firstSymbolToLowerCase(str)
            {
                return str.substring(0, 1).toLowerCase() + str.substring(1);
            }
            
            //Функция, которая делает первую букву в тексте большой:
            function firstSymbolToUpperCase(str)
            {
                return str.substring(0, 1).toUpperCase() + str.substring(1);
            }

            function getAnswer(question)
            {
                //преобразование текста из параметра функции question 
                //чтобы сделать первую букву в тексте вопроса прописной (маленькой)
                let text = firstSymbolToLowerCase(question);
                //знаки препинания
                let separators = "'\",.!?()[]\\/";
                //добавление пробелов перед знаками препинания
                for(let i = 0; i < separators.length; i++)
                    text = text.replace(separators[i], " " + separators[i]);    // replace(что заменить, на что заменить)

                //массив слов и знаков препинания, отделенных пробелами
                let words = text.split(' ');

                //перебор слов в массиве слов из вопроса: первый символ каждого слова к lowerCase
                for(let i = 0; i < words.length; i++)
                    words[i] = firstSymbolToLowerCase(words[i]);

                //флаг, найден ли ответ на вопрос
                let result = false;
                let answer = "";

                for(let i = 0; i < words.length; i++)
                {
                    // поиск номера псевдоокончания сказуемого
                    let ending = getEndingIndex(words[i]);

                    if(ending >= 0)
                    {
                        //замена псевдоокончания на набор возможных окончаний, хранящихся 
                        //во втором столбце массива. пример, глагол "ведет"(5) - endings[0][0].length (ет(2)). substring(0, 3) = вед + (ет|ут|ют) = вед(ет|ут|ют)

                        words[i] = words[i].substring(0, 
                          words[i].length - endings[ending][0].length) + endings[ending][1]

                        console.log(words)
                        
                        //создание регулярного выражения для поиска по сказуемому из вопроса
                        let predicate = new RegExp(".*" + words[i] + ".*");     // .*: любой символ (кроме новой строки) ноль или более раз.

                        //для кратких прилагательных нужно захватить следующее за найденным слово
                        if(endings[ending][0] == endings[ending][1])
                        {
                            if(words[i] != "нужен")
                            {
                                predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");    // захватываем следующее за ним слово
                                i++;
                            }
                        }
                        console.log(predicate)  

                        //создание регулярного выражения для поиска по подлежащему из вопроса. пример «Как рассчитывается площадь квадрата» после сказуемого будет сформировано 
                        //регулярное выражение  для подлежащего: «.*площадь.*квадрата.*», 

                        let subjectReg = words.slice(i + 1).join(".*");
                        //words.slice(i + 1): Метод slice используется для создания нового массива, начиная с элемента i + 1 и до конца массива words. Он возвращает подмассив, не изменяя 
                        //оригинальный массив.

                        //.join(".*"): Метод join используется для объединения элементов массива в строку с указанным разделителем. В данном случае, элементы массива будут 
                        //объединены с использованием строки ".*" в качестве разделителя.
                        console.log(subjectReg)
                        
                        //только если в подлежащем больше трех символов
                        if(subjectReg.length > 3)
                        {
                            let subject = new RegExp(".*" + subjectReg + ".*");
                            console.log(subject)

                            //поиск совпадений с шаблонами среди связей семантической сети
                            for (let j = 0; j < knowledge.length; j++)
                            {
                                if(predicate.test(knowledge[j][1].toLowerCase()) && (subject.test(knowledge[j][0].toLowerCase()) || subject.test(knowledge[j][2].toLowerCase())))
                                {
                                    //создание простого предложения из семантической связи
                                    answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                                    result = true;
                                }
                            }

                            //если совпадений с двумя шаблонами нет,
                            if(!result)
                            {
                                //поиск совпадений только с шаблоном подлежащего
                                for(let j = 0; j < knowledge.length; j++)
                                {
                                    if(subject.test(knowledge[j][0].toLowerCase() || subject.test(knowledge[j][2].toLowerCase())))
                                    {
                                        //создание простого предложения из семантической связи
                                        answer += firstSymbolToUpperCase(knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]);
                                        result = true;
                                        break;
                                    }
                                }
                            }
                        }
                    }
                }
                //если ответа нет
                if(!result)
                    answer = "Ответ не найден.";
                  
                return answer;
            }

            function GetDialog() {
              let answers = [];
              let div = document.createElement('div');
    
              for(let i = 0; i < questions.length; i++) 
              {
                let userQuestion = questions[i]; 
                let answer = getAnswer(userQuestion);
                answers.push(answer); 
                // Создаем новый элемент p для каждого вопроса и ответа
                let p = document.createElement('p');
                p.textContent = `${i + 1}.`+" Вопрос: " + userQuestion + "\nОтвет: " + answer;
                div.appendChild(p); // Добавляем элемент p в div
              }
              document.body.appendChild(div);
            }
                
            const questions = [
              "Что такое электрическое поле?",
              "Какое влияние оказывает температура на проводимость материала?",
              "Каким образом определяется удельное сопротивление материала?",
              "Как работает омметр?",
              "Чему равно удельное сопротивление материала?",
              "Что определяет закон Ома?",
              "Каково воздействие электрического поля на электрический диполь?",
              "Какие свойства материалов определяют их электрическую проводимость?",
              "Какие параметры характеризуют тепловое равновесие?",
              "Что описывает теплопроводность?",
              //"Что определяет константу материала при изменении температуры?",
              "Каким образом проводимость материала зависит от его структуры?",
              "Что такое тепловое расширение и как оно влияет на проводимость материала?",
              "Какие процессы лежат в основе закона сохранения заряда?",
              //"Чем характеризуются электростатические силы в проводнике?",
              "Как теплопроводность вещества влияет на электрический ток?",
              "Что определяет тепловое сопротивление?",
              "Как достигается термическое равновесие?",
              "Что такое элементарный электрический заряд?",
              "Какие методы используются для измерения электрического сопротивления проводника?",
              "Что вызывает температурный градиент?",
              "Что использует электроника?",
              "Что определяет термодинамические процессы в электрических цепях?",
              "Какие факторы влияют на процесс нагревания проводника?",
              "Каковы основные особенности закона Кулона в электричестве?",
              "Что определяет тепловой поток в проводнике?",
              "Как измеряется сила тока?",
              "Какие процессы определяют электрический потенциал?",
              "Как измеряется электрическое сопротивление?",
              "Как влияет температура на проводимость материала?",
              "Что описывает температурный коэффициент сопротивления?",
              "Чем помогает схема установки?",
              "Какие основные параметры влияют на электрическое сопротивление материала?",
              "Что производит источник тока?",
              "Как определяется электрическая цепь?",
              "Как происходит теплоотдача?",
              "Как вычисляется мощность?",
              "Какой эффект оказывает изменение размеров проводника на его сопротивление?",
              "Как теплопроводность влияет на проводимость вещества?",
              "Чем является закон Ома?",
              "Каким образом проводимость материала зависит от его физических свойств?",
              "Чем определяется тепловой поток в проводнике при нагревании?",
              "Какие процессы влияют на термодинамические процессы в электрических цепях?",
              "Какой метод применяется для измерения температуры проводника?",
              "Что предотвращает изоляция?",
              "Какую роль играет изоляция?",
              "Чем характеризуется температурная зависимость сопротивления?",
              "К чему приводят электролиты?",
              "Что позволяют полупроводниковые материалы?",
              "На что воздействует магнитное поле?",
              "Что определяет скорость движения свободных носителей заряда?",
              "Как энергия тратится при прохождении электрического тока через проводник?",
              "Чем выдаются токопроводящие материалы?",
              "К чему приводит усредненное тепловое движение?",
              "Что представляет усредненное тепловое движение?",
              "Чем помогают устройства измерения?",
              "Что содержит электрическая цепь?",
              "Что происходит при достижении теплового равновесия в экспериментальной установке?",
              "Каким образом проводимость материала зависит от количества свободных носителей заряда?",
              "От чего зависит температурный коэффициент?",
              "Что сохраняют изолированные системы?",
              "На что тратится энергия при прохождении электрического тока через проводник?",
              "Чем является проводник?",
              "Чем является диэлектрик?",
              "Что создаёт газовая горелка?",
              "Чем является омметр?",
              "В чём измеряется удельное сопротивление?",
              "Что является площадью?",
              "Что называется градусом Кельвина?",
              "Чему равен градус Кельвин?",
              "Что называется градусом Цельсия?",
              "Что является градусником?",
              "Какие бывают термометры?",
              "Какие бывают омметры?",
              "Что называется графиком?",
              "Что является проводом?",
              "Что является кристаллической решёткой?",
              //"Что представляет собой неспаренный электрон?",
              "Чем является свободный электрон?",
              "Чему равен температурный коэффициент алюминия?",
              "Чему равен температурный коэффициент свинца?",
              "Чему равен температурный коэффициент железа?",
              "Что называется протоном?",
              "Что называется резистором?",
            ];

            function Script() {
                for (let i = 0; i < questions.length; i++) {
                    if (confirm("Продолжить диалог?")) {
                        let userQuestion = prompt("Введите вопрос", questions[i]);
                        alert(getAnswer(userQuestion));
                    } else {
                        break;
                    }
                }
            }