const knowledge = [
  [
    "Электрическое поле",
    "является",
    "физическим полем, окружающим электрически заряженные частицы, вызывающим воздействие на другие заряженные частицы внутри этого поля.",
  ],
  [
    "Сила тока",
    "определяется",
    "количеством электричества, протекающего через поперечное сечение проводника за единицу времени.",
  ],
  [
    "Электродинамика",
    "изучает",
    "законы движения электрических зарядов и электромагнитные поля в пространстве и времени.",
  ],
  [
    "Тепловое воздействие",
    "влияет",
    "на изменение сопротивления проводника из-за изменения температуры.",
  ],
  [
    "Проводимость",
    "зависит",
    "от количества свободных носителей заряда в веществе и подвижности этих носителей.",
  ],
  [
    "Кристаллическая структура",
    "влияет",
    "на сопротивление проводника при его нагревании.",
  ],
  [
    "Удельное сопротивление",
    "характеризует",
    "сопротивление единичного образца материала при единичной длине и площади поперечного сечения.",
  ],
  [
    "Зависимость сопротивления от температуры",
    "определяется",
    "коэффициентом температурного сопротивления материала.",
  ],
  [
    "Электрический ток",
    "является",
    "потоком заряженных частиц, движущихся вдоль проводника под воздействием электрического поля.",
  ],
  [
    "Энергетические потери",
    "возникают",
    "в проводнике из-за тепловых эффектов при прохождении электрического тока.",
  ],
  [
    "Экспериментальная установка",
    "используется",
    "для измерения удельного сопротивления проводника при его нагревании.",
  ],
  [
    "Электрическое сопротивление",
    "определяется",
    "отношением напряжения к силе тока в электрической цепи.",
  ],
  [
    "Проводимость материала",
    "определяется",
    "способностью проводить электрический ток под воздействием электрического поля.",
  ],
  [
    "Теплопроводность",
    "описывает",
    "способность вещества передавать тепловую энергию.",
  ],
  [
    "Омметр",
    "применяется",
    "для измерения электрического сопротивления проводника.",
  ],
  [
    "Тепловое равновесие",
    "достигается",
    "при установлении равномерной температуры в экспериментальной установке.",
  ],
  [
    "Разогрев проводника",
    "приводит",
    "к изменению его сопротивления из-за воздействия тепловой энергии.",
  ],
  [
    "Тепловое расширение",
    "влияет",
    "на размеры и форму проводника при изменении его температуры.",
  ],
  [
    "Электрическое сопротивление",
    "определяется",
    "материалом и геометрией проводника.",
  ],
  [
    "Температурный коэффициент сопротивления",
    "описывает",
    "изменение сопротивления проводника при изменении температуры.",
  ],
  [
    "Электрический заряд",
    "представляет",
    "основную единицу измерения электрического заряда частицы.",
  ],
  [
    "Свободные носители заряда",
    "обеспечивают",
    "передачу электрического тока в проводнике.",
  ],
  [
    "Энергия",
    "расходуется",
    "на преодоление сопротивления проводника при прохождении электрического тока.",
  ],
  [
    "Токопроводящие материалы",
    "обладают",
    "высокой проводимостью и низким сопротивлением.",
  ],
  [
    "Скорость движения свободных носителей заряда",
    "определяет",
    "интенсивность электрического тока.",
  ],
  [
    "Усредненное тепловое движение",
    "приводит",
    "к статистическому распределению энергии в веществе.",
  ],
  [
    "Длина проводника",
    "влияет",
    "на его сопротивление при прохождении электрического тока.",
  ],
  [
    "Площадь поперечного сечения проводника",
    "определяет",
    "сопротивление при прохождении электрического тока.",
  ],
  [
    "Электрическая цепь",
    "содержит",
    "элементы, включая проводники, источники тока и нагрузки.",
  ],
  [
    "Тепловое равновесие",
    "достигается",
    "при одинаковой температуре внутри проводника.",
  ],
  [
    "Источник тока",
    "производит",
    "электрическую энергию для потребления в электрической цепи.",
  ],
  [
    "Удельное сопротивление материала",
    "зависит",
    "от химических свойств вещества и температуры.",
  ],
  [
    "Константа материала",
    "определяет",
    "постоянство сопротивления при изменении температуры.",
  ],
  [
    "Температурная зависимость сопротивления",
    "характеризует",
    "изменение сопротивления проводника с изменением температуры.",
  ],
  [
    "Полупроводниковый материал",
    "используется",
    "для создания электронных компонентов с контролируемой проводимостью.",
  ],
  [
    "Электролиты",
    "характеризуются",
    "высокой проводимостью при перемещении ионов.",
  ],
  [
    "Электрические свойства материала",
    "определяются",
    "структурой его атомов и молекул.",
  ],
  [
    "Мощность",
    "вычисляется",
    "как произведение силы тока на напряжение в электрической цепи.",
  ],
  [
    "Энергопотери",
    "связаны",
    "с преобразованием энергии в тепло при прохождении тока через проводник.",
  ],
  [
    "Схема установки",
    "помогает",
    "в проведении измерений удельного сопротивления проводника.",
  ],
  [
    "Электрический ток",
    "протекает",
    "в проводнике из-за движения свободных носителей заряда.",
  ],
  [
    "Сопротивление материала",
    "влияет",
    "на эффективность передачи электрического тока.",
  ],
  [
    "Энергия",
    "потребляется",
    "при преодолении сопротивления проводника при прохождении тока.",
  ],
  [
    "Электроника",
    "использует",
    "свойства материалов для создания электрических устройств.",
  ],
  [
    "Магнитное поле",
    "воздействует",
    "на движение заряженных частиц в проводнике.",
  ],
  [
    "Кондуктивность материала",
    "определяется",
    "его способностью проводить электрический ток.",
  ],
  ["Компоненты установки", "включают", "горелку, стойку, омметр и термометр."],
  [
    "Тепловое сопротивление",
    "определяет",
    "трудность передачи тепла через материал.",
  ],
  [
    "Плотность электрического тока",
    "зависит",
    "от площади поперечного сечения проводника.",
  ],
  [
    "Электромагнитное воздействие",
    "приводит",
    "к изменению свойств проводника.",
  ],
  [
    "Электрический диполь",
    "обладает",
    "полярностью и способен создавать электрическое поле в проводнике.",
  ],
  ["Медь", "является", "хорошим проводником из-за своей высокой проводимости."],
  [
    "Электрическое напряжение",
    "приводит",
    "к движению электрических зарядов в проводнике.",
  ],
  [
    "Энергетические потери",
    "возникают",
    "при преобразовании энергии в тепло в проводнике.",
  ],
  [
    "Электростатические силы",
    "воздействуют",
    "на заряды в проводнике, создавая движение.",
  ],
  [
    "Устройства измерения",
    "помогают",
    "определить параметры электрических свойств материалов.",
  ],
  [
    "Термодинамические процессы",
    "влияют",
    "на изменение сопротивления проводника.",
  ],
  ["Теплоотдача", "происходит", "через проводник при нагревании."],
  [
    "Изоляция",
    "предотвращает",
    "нежелательный контакт с проводниками для безопасности.",
  ],
  [
    "Электрическая емкость",
    "определяет",
    "способность проводника накапливать заряд.",
  ],
  [
    "Температурный градиент",
    "вызывает",
    "изменения в сопротивлении проводника.",
  ],
  [
    "Тепловое равновесие",
    "достигается",
    "при равномерной температуре внутри проводника.",
  ],
  [
    "Электрические контакты",
    "позволяют",
    "подключить проводники к другим элементам цепи.",
  ],
  [
    "Диэлектрические материалы",
    "характеризуются",
    "низкой проводимостью для электрического тока.",
  ],
  ["Источник нагрева", "приводит", "к повышению температуры проводника."],
  [
    "Физические свойства материала",
    "влияют",
    "на его способность проводить электрический ток.",
  ],
  [
    "Георг Ом",
    "сформулировал",
    "знаменитый закон, описывающий связь между напряжением, током и сопротивлением в электрической цепи.",
  ],
  [
    "Закон Ома",
    "является",
    "одним из основных принципов в изучении электричества и электроники.",
  ],
  [
    "Электрический заряд",
    "представляет",
    "фундаментальный заряд частицы, отвечающий за электрические взаимодействия в материи.",
  ],
  [
    "Электрический заряд",
    "может быть",
    "положительным или отрицательным в зависимости от количества эксцентрических электронов.",
  ],
  [
    "Модель атома",
    "описывает",
    "положительно заряженное ядро, вокруг которого обращаются отрицательно заряженные электроны.",
  ],
  [
    "Элементарный электрический заряд",
    "равен",
    "приблизительно 1.602 x 10^-19 кулонов.",
  ],
  [
    "Закон Кулона",
    "описывает",
    "взаимодействие между заряженными частицами с учетом величины и расстояния между ними.",
  ],
  [
    "Сила тока",
    "определяется",
    "количеством электрических зарядов, протекающих через единицу времени.",
  ],
  [
    "Электрический потенциал",
    "связан",
    "с работой по перемещению заряда в электрическом поле.",
  ],
  [
    "Электростатика",
    "изучает",
    "статические заряды и их взаимодействие в отсутствии движения.",
  ],
  [
    "Принцип сохранения заряда",
    "утверждает",
    "неизменность общего количества электрического заряда в изолированной системе.",
  ],
  [
    "Изолированные системы",
    "сохраняют",
    "суммарный электрический заряд неизменным с течением времени.",
  ],
  [
    "Спиртовая горелка",
    "представляет",
    "устройство для создания открытого огня, использующее спирт в качестве топлива.",
  ],
  [
    "Омметр",
    "является",
    "прибором для измерения электрического сопротивления в электрических цепях.",
  ],
  [
    "Термометр",
    "предназначен",
    "для измерения температуры вещества или окружающей среды.",
  ],
  [
    "Температура",
    "определяется",
    "количеством тепловой энергии в системе или среде.",
  ],
  [
    "Нагревание",
    "является",
    "процессом передачи тепловой энергии объекту, повышающим его температуру.",
  ],
  [
    "Тепловой поток",
    "передает",
    "тепловую энергию от более горячего объекта к менее горячему.",
  ],
  [
    "Экспансия",
    "происходит",
    "при увеличении объема вещества в результате его нагревания.",
  ],
  [
    "Фазовые переходы",
    "включают",
    "изменения состояния вещества при изменении температуры.",
  ],
  [
    "Термодинамические процессы",
    "связаны",
    "с изменением температуры и энергии в системе.",
  ],
  [
    "Теплопроводность",
    "определяет",
    "способность вещества передавать тепловую энергию.",
  ],
  [
    "Термическое равновесие",
    "достигается",
    "при равномерном распределении тепла в системе.",
  ],
];
